IDEA Open Model
OpenObject Class
Compatible with IDEA StatiCa 20.1
 Open object base class POS - class can not be abstract -it causes problems with serialization
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 More...
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class OpenObject
Public Class OpenObject
The OpenObject type exposes the following members.
Constructors
Name | Description
OpenObject
Initializes a new instance of the OpenObject class
Top
See Also
Reference
IdeaRS.OpenModel Namespace
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Concrete.CalculationSetup
 IdeaRS.OpenModel.Concrete.Load.StagesLoading
 IdeaRS.OpenModel.Concrete.ProjectDataConcrete
 IdeaRS.OpenModel.Concrete.TimeAxis
 IdeaRS.OpenModel.Concrete.TimePoint
 IdeaRS.OpenModel.CrossSection.CssComponent
 IdeaRS.OpenModel.CrossSection.Parameter
 IdeaRS.OpenModel.CrossSection.ReinforcedBar
 IdeaRS.OpenModel.CrossSection.Stirrup
 IdeaRS.OpenModel.CrossSection.TendonBar
 IdeaRS.OpenModel.CrossSection.TendonDuct
 IdeaRS.OpenModel.Detail.Loading.LoadBase
 IdeaRS.OpenModel.Geometry2D.Point2D
 IdeaRS.OpenModel.Geometry2D.Polygon2D
 IdeaRS.OpenModel.Geometry2D.PolyLine2D
 IdeaRS.OpenModel.Geometry2D.Region2D
 IdeaRS.OpenModel.Geometry2D.Segment2D
 IdeaRS.OpenModel.Geometry2D.Vector2D
 IdeaRS.OpenModel.Geometry3D.CoordSystem
 IdeaRS.OpenModel.Geometry3D.Polygon3D
 IdeaRS.OpenModel.Geometry3D.Vector3D
 IdeaRS.OpenModel.Loading.CombiItem
 IdeaRS.OpenModel.Loading.CrossSectionComponentEdges
 IdeaRS.OpenModel.Material.MaterialStrength
 IdeaRS.OpenModel.Material.MaterialStrengthProperty
 IdeaRS.OpenModel.Message.OpenMessage
 IdeaRS.OpenModel.Model.DesignMemberInSubStructure
 IdeaRS.OpenModel.Model.RebarHookBase
 IdeaRS.OpenModel.Model.RebarPolyLine3D
 IdeaRS.OpenModel.Model.RebarSegment3DBase
 IdeaRS.OpenModel.Model.SubStructureGeometry
 IdeaRS.OpenModel.Model.SubStructureLoading
 IdeaRS.OpenModel.OpenAttribute
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.OriginSettings
 IdeaRS.OpenModel.ProjectData
 IdeaRS.OpenModel.ProjectDataEc